<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_6_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%ED%96%89%2C_%EC%97%B4_%EC%82%AD%EC%A0%9C%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friends = [{'name': 'John', 'age': 20, 'job': 'student'},
                {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job'])

In [ ]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [ ]:
df.drop(['John', 'Nate'])

       age        job
Jenny   30  developer

In [ ]:
# inplace 를 쓰면 바로 삭제, 따로 저장할 필요가 없다. 
df.drop(['John', 'Nate'], inplace=True)
df

       age        job
Jenny   30  developer

In [ ]:
friends = [{'name': 'John', 'age': 20, 'job': 'student'},
                {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# Index안의 인덱스 번호를 써서 삭제
df = df.drop(df.index[[0, 2]])

In [ ]:
df

    name  age        job
1  Jenny   30  developer

In [ ]:
df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# 컬럼의 value에 따라서도 가능하다. 
df = df[df.age > 20]
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# column을 삭제하는 방법
df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# age 정보만 삭제
df = df.drop('age', axis=1)
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [ ]:
# column을 삭제하는 방법
df = pd.DataFrame(friends,
                  columns = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# age 정보만 삭제
df.drop('age', axis=1, inplace=True)

In [ ]:
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher